stress-test/authentication-loadtest.yml
config:
  target: "http://localhost:5002/api"
  phases:
    - duration: 20
      arrivalRate: 40
      name: "Warming up"
    - duration: 20
      arrivalRate: 40
      rampTo: 1000
      name: "Ramping up"
    - duration: 20
      arrivalRate: 1000
      name: "Sustained load"
  processor: "./processor.js"
 
scenarios:
  - name: "Sign up flow"
    flow:
      - post:
          url: "/register"
          beforeRequest: generateSignupData
          json:
            email: "{{ email }}"
            username: "{{ username }}"
            password: "{{ password }}"
            firstname: "{{ firstname }}"
            lastname: "{{ lastname }}"
            birthdate: "{{ birthdate }}"
            role: "{{ role }}"
      - think: 2
      - post:
          url: "/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: $.token
              as: token
      - think: 2
      - post:
          url: "/userAddress"
          beforeRequest: generateAddressData
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            address1: "{{ address1 }}"
            address2: "{{ address2 }}"
            city: "{{ city }}"
            region: "{{ region }}"
            country: "{{ country }}"
            postalCode: "{{ postalCode }}"