stress-test/inventory-loadtest.yml
config:
  target: "http://localhost:5003/api"
  phases:
    - duration: 20
      arrivalRate: 20
      name: "Warming up"
    - duration: 20
      arrivalRate: 20
      rampTo: 100
      name: "Ramping up"
    - duration: 20
      arrivalRate: 100
      name: "Sustained load"
  processor: "./processor.js"
 
scenarios:
  - name: "Product creation"
    flow:
      - post:
          url: "/seller/product"
          beforeRequest: generateProductData
          json:
            name: "{{ name }}"
            label: "{{ label }}"
            description: "{{ description }}"
            condition: "{{ condition }}"
            unitPrice: "{{ unitPrice }}"
            availableQuantity: "{{ availableQuantity }}"
            sellerId: "{{ sellerId }}"
            onSale: "{{ onSale }}"